#
## Poorman's Standard-Emulator by GoodKook, goodkook@gmail.com
### Yosys script targetting GoWin's FPGA
#
#   yosys pong_pt1_wrapper.ys | tee synthesis.log
#
read_verilog ../../../pong_pt1_wrapper.v
#read_verilog -sv -DVGAX_120x60 ../../../../source/pong_pt1.v
read_verilog -sv -DGLCD_128x64 ../../../../source/pong_pt1.v
read_verilog -sv ../../../../source/pixel_gen.v

hierarchy -check -top pong_pt1_wrapper

synth_gowin -top pong_pt1_wrapper -noalu -vout pong_pt1_wrapper.v
stat
