# Synthesis script for yosys created by qflow
read_liberty -lib -ignore_miss_dir -setattr blackbox /usr/local/share/qflow/tech/etri050/etri05_stdcells.lib
read_verilog  /home/goodkook/ETRI050_DesignKit/devel/Ref_Design/pong_pt1/source/pong_pt1.v
# Hierarchy check
hierarchy -check
